theatrus/ksdk/platform/system/src/clock/MK60D10/fsl_clock_MK60D10.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <stdlib.h>
#include <stdbool.h>
#include <assert.h>
#include "fsl_device_registers.h"
#include "fsl_mcg_hal.h"
#include "fsl_sim_hal.h"
#include "fsl_osc_hal.h"
#include "fsl_lptmr_hal.h"
#include "fsl_clock_manager.h"

/*
 * README:
 * This file should provide these APIs:
 * 1. APIs to get the frequency of output clocks in Reference Manual ->
 * Chapter Clock Distribution -> Figure Clocking diagram.
 * 2. APIs for IP modules listed in Reference Manual -> Chapter Clock Distribution
 * -> Module clocks.
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
uint32_t g_enet1588ClkInFreq[ENET_EXT_CLK_COUNT];  /* ENET_1588_CLKIN  */
uint32_t g_sdhcClkInFreq[SDHC_EXT_CLK_COUNT];      /* SDHC_CLKIN       */
uint32_t g_usbClkInFreq[USB_EXT_CLK_COUNT];        /* USB_CLKIN        */
uint32_t g_ftmClkFreq[FTM_EXT_CLK_COUNT];          /* FTM_CLK0         */

/* Default pre-defined clock configurations. */
clock_manager_user_config_t g_defaultClockConfigurations[CLOCK_CONFIG_NUM] =
{
    /* Configuration for enter VLPR mode. Core clock = 4MHz. */
    {
        .mcgConfig =
        {
            .mcg_mode           = kMcgModeBLPI,   // Work in BLPI mode.
            .irclkEnable        = true,  // MCGIRCLK enable.
            .irclkEnableInStop  = false, // MCGIRCLK disable in STOP mode.
            .ircs               = kMcgInternalRefClkSelFast, // Select IRC4M.
            .fcrdiv             = 0U,    // FCRDIV is 0.

            .frdiv   = 0U,
            .drs     = kMcgDcoRangeSelLow,  // Low frequency range
            .dmx32   = kMcgDmx32Default,    // DCO has a default range of 25%
            .oscsel  = kMcgOscselOsc,       // Select OSC

            .pll0Enable        = false,  // PLL0 disable
            .pll0EnableInStop  = false,  // PLL0 disalbe in STOP mode
            .prdiv0            = 0U,
            .vdiv0             = 0U,
        },
        .simConfig =
        {
            .PllFllSel = kClockPllFllSelFll, // PLLFLLSEL select FLL.
            .er32kSrc  = kClockEr32kSrcRtc,     // ERCLK32K selection, use RTC.
            .outdiv1   = 0U,
            .outdiv2   = 0U,
            .outdiv3   = 0U,
            .outdiv4   = 4U,
        },
        .oscerConfig =
        {
            .Enable       = true,  // OSCERCLK enable.
            .EnableInStop = false, // OSCERCLK disable in STOP mode.
        }
    },

    /* Configuration for enter RUN mode. Core clock = 96MHz. */
    {
        .mcgConfig =
        {
            .mcg_mode           = kMcgModePEE,   // Work in PEE mode.
            .irclkEnable        = true,  // MCGIRCLK enable.
            .irclkEnableInStop  = false, // MCGIRCLK disable in STOP mode.
            .ircs               = kMcgInternalRefClkSelSlow, // Select IRC32k.
            .fcrdiv             = 0U,    // FCRDIV is 0.

            .frdiv   = 5U,
            .drs     = kMcgDcoRangeSelLow,  // Low frequency range
            .dmx32   = kMcgDmx32Default,    // DCO has a default range of 25%
            .oscsel  = kMcgOscselOsc,       // Select OSC

            .pll0Enable        = false,  // PLL0 disable
            .pll0EnableInStop  = false,  // PLL0 disalbe in STOP mode
            .prdiv0            = 0x18U,
            .vdiv0             = 0x18U,
        },
        .simConfig =
        {
            .PllFllSel = kClockPllFllSelPll,    // PLLFLLSEL select PLL.
            .er32kSrc  = kClockEr32kSrcRtc,     // ERCLK32K selection, use RTC.
            .outdiv1   = 0U,
            .outdiv2   = 1U,
            .outdiv3   = 1U,
            .outdiv4   = 3U,
        },
        .oscerConfig =
        {
            .Enable       = true,  // OSCERCLK enable.
            .EnableInStop = false, // OSCERCLK disable in STOP mode.
        }
    },
};

/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_FllStableDelay
 * Description   : This funtion is used to delay for FLL stable.
 * According to datasheet, every time the FLL reference source or reference
 * divider is changed, trim value is changed, DMX32 bit is changed, DRS bits
 * are changed, or changing from FLL disabled (BLPE, BLPI) to FLL enabled
 * (FEI, FEE, FBE, FBI), there should be 1ms delay for FLL stable. Please
 * check datasheet for t(fll_aquire).
 *
 *END**************************************************************************/
static void CLOCK_SYS_FllStableDelay(void)
{
    uint32_t coreClk = CLOCK_SYS_GetCoreClockFreq();

