theatrus/ksdk/platform/system/src/clock/MK60D10/fsl_clock_MK60D10.c
    SIM_HAL_DisableClock(SIM_BASE, ftmGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetFtmGateCmd
 * Description   : Get the the clock gate state for FTM module
 * This function will get the clock gate state for FTM module.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetFtmGateCmd(uint32_t instance)
{
    assert(instance < sizeof(ftmGateTable)/sizeof(ftmGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM_BASE, ftmGateTable[instance]);
}

/* SPI instance table. */
static const sim_clock_gate_name_t spiGateTable[] =
{
    kSimClockGateSpi0,
    kSimClockGateSpi1,
    kSimClockGateSpi2
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnableSpiClock
 * Description   : Enable the clock for SPI module
 * This function enables the clock for SPI module
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableSpiClock(uint32_t instance)
{
    assert(instance < sizeof(spiGateTable)/sizeof(spiGateTable[0]));

    SIM_HAL_EnableClock(SIM_BASE, spiGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisableSpiClock
 * Description   : Disable the clock for SPI module
 * This function disables the clock for SPI module
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableSpiClock(uint32_t instance)
{
    assert(instance < sizeof(spiGateTable)/sizeof(spiGateTable[0]));

    SIM_HAL_DisableClock(SIM_BASE, spiGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetSpiGateCmd
 * Description   : Get the the clock gate state for SPI module
 * This function will get the clock gate state for SPI module.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetSpiGateCmd(uint32_t instance)
{
    assert(instance < sizeof(spiGateTable)/sizeof(spiGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM_BASE, spiGateTable[instance]);
}

/* I2C instance table. */
static const sim_clock_gate_name_t i2cGateTable[] =
{
    kSimClockGateI2c0,
    kSimClockGateI2c1
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnableI2cClock
 * Description   : Enable the clock for I2C module
 * This function enables the clock for I2C module
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableI2cClock(uint32_t instance)
{
    assert(instance < sizeof(i2cGateTable)/sizeof(i2cGateTable[0]));

    SIM_HAL_EnableClock(SIM_BASE, i2cGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisableI2cClock
 * Description   : Disable the clock for I2C module
 * This function disables the clock for I2C module
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableI2cClock(uint32_t instance)
{
    assert(instance < sizeof(i2cGateTable)/sizeof(i2cGateTable[0]));
    SIM_HAL_DisableClock(SIM_BASE, i2cGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetI2cGateCmd
 * Description   : Get the the clock gate state for I2C module
 * This function will get the clock gate state for I2C module.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetI2cGateCmd(uint32_t instance)
{
    assert(instance < sizeof(i2cGateTable)/sizeof(i2cGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM_BASE, i2cGateTable[instance]);
}

/* Uart instance table. */
static const sim_clock_gate_name_t uartGateTable[] =
{
    kSimClockGateUart0,
    kSimClockGateUart1,
    kSimClockGateUart2,
    kSimClockGateUart3,
    kSimClockGateUart4,
    kSimClockGateUart5
};

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableUartClock
 * Description   : Enable the clock for UART module
 * This function enables the clock for UART module
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableUartClock(uint32_t instance)
{
    assert(instance < sizeof(uartGateTable)/sizeof(uartGateTable[0]));

    SIM_HAL_EnableClock(SIM_BASE, uartGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableUartClock
 * Description   : Disable the clock for UART module
 * This function enables the clock for UART module
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableUartClock(uint32_t instance)
{
    assert(instance < sizeof(uartGateTable)/sizeof(uartGateTable[0]));

    SIM_HAL_DisableClock(SIM_BASE, uartGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetUartGateCmd
 * Description   : Get the the clock gate state for UART module
 * This function will get the clock gate state for UART module.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetUartGateCmd(uint32_t instance)
{
    assert(instance < sizeof(uartGateTable)/sizeof(uartGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM_BASE, uartGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_Osc0Init
 * Description   : Initialize OSC0.
 *
 * This function initializes OSC0 according to configuration.
 *
 *END**************************************************************************/
clock_manager_error_code_t CLOCK_SYS_Osc0Init(osc_user_config_t *config)
{
    mcg_freq_range_select_t range = (mcg_freq_range_select_t)0U;
    uint32_t freq = config->freq;

    if (kMcgExternalRefClkSelOsc == config->erefs) /* oscillator is used. */
    {
        if ((freq < kMcgConstant1000) ||
           ((freq > kMcgConstant32768) && (freq < kMcgConstant3000000)) ||
            (freq > kMcgConstant32000000))
        {
            return kClockManagerInvalidParam;
        }
        else if (freq < kMcgConstant32768)
        {
            range = kMcgFreqRangeSelLow;
        }
        else if (freq < kMcgConstant8000000)
        {
            range = kMcgFreqRangeSelHigh;
        }
        else
        {
            range = kMcgFreqRangeSelVeryHigh;
        }
    }

    CLOCK_HAL_SetOsc0Mode(MCG_BASE, range, config->hgo, config->erefs);

    if (kMcgExternalRefClkSelOsc == config->erefs) /* oscillator is used. */
    {
        while(CLOCK_HAL_GetOscInit0(MCG_BASE)){}
    }

    if (config->enableExternalRef)
    {
        OSC_HAL_SetExternalRefClkCmd(g_oscBaseAddr[0], true);
        if (config->enableExternalRefInStop)
        {
            OSC_HAL_SetExternalRefClkInStopModeCmd(g_oscBaseAddr[0], true);
        }
    }

    g_xtal0ClkFreq = freq;

    return kClockManagerSuccess;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_Osc0Deinit
 * Description   : De-initialize OSC0.
 *
 *END**************************************************************************/
void CLOCK_SYS_Osc0Deinit(void)
{
    OSC_HAL_SetExternalRefClkInStopModeCmd(g_oscBaseAddr[0], false);
    OSC_HAL_SetExternalRefClkCmd(g_oscBaseAddr[0], false);
    CLOCK_HAL_SetRange0Mode(MCG_BASE, kMcgFreqRangeSelLow);
    CLOCK_HAL_SetHighGainOsc0Mode(MCG_BASE, kMcgHighGainOscSelLow);
    CLOCK_HAL_SetExternalRefSel0Mode(MCG_BASE, kMcgExternalRefClkSelExternal);

    g_xtal0ClkFreq = 0U;
}


/*******************************************************************************
 * EOF
 ******************************************************************************/
